nrf-rs/nrf-pacs/svds/nrf5340-net.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TEMP_NS</name>
      <description>Temperature Sensor</description>
      <baseAddress>0x41010000</baseAddress>
      <headerStructName>TEMP</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TEMP</name>
        <value>16</value>
      </interrupt>
      <groupName>TEMP</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Start temperature measurement</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_START</name>
              <description>Start temperature measurement</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop temperature measurement</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STOP</name>
              <description>Stop temperature measurement</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_START</name>
          <description>Subscribe configuration for task START</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task START will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STOP</name>
          <description>Subscribe configuration for task STOP</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task STOP will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_DATARDY</name>
          <description>Temperature measurement complete, data ready</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_DATARDY</name>
              <description>Temperature measurement complete, data ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_DATARDY</name>
          <description>Publish configuration for event DATARDY</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event DATARDY will publish to.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATARDY</name>
              <description>Write '1' to enable interrupt for event DATARDY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATARDY</name>
              <description>Write '1' to disable interrupt for event DATARDY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMP</name>
          <description>Temperature in degC (0.25deg steps)</description>
          <addressOffset>0x508</addressOffset>
          <access>read-only</access>
          <dataType>int32_t</dataType>
          <fields>
            <field>
              <name>TEMP</name>
              <description>Temperature in degC (0.25deg steps)</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>A0</name>
          <description>Slope of first piecewise linear function</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <resetValue>0x000002D9</resetValue>
          <fields>
            <field>
              <name>A0</name>
              <description>Slope of first piecewise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>A1</name>
          <description>Slope of second piecewise linear function</description>
          <addressOffset>0x524</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000322</resetValue>
          <fields>
            <field>
              <name>A1</name>
              <description>Slope of second piecewise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>A2</name>
          <description>Slope of third piecewise linear function</description>
          <addressOffset>0x528</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000355</resetValue>
          <fields>
            <field>
              <name>A2</name>
              <description>Slope of third piecewise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>A3</name>
          <description>Slope of fourth piecewise linear function</description>
          <addressOffset>0x52C</addressOffset>
          <access>read-write</access>
          <resetValue>0x000003DF</resetValue>
          <fields>
            <field>
              <name>A3</name>
              <description>Slope of fourth piecewise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>A4</name>
          <description>Slope of fifth piecewise linear function</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000044E</resetValue>
          <fields>
            <field>
              <name>A4</name>
              <description>Slope of fifth piecewise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>A5</name>
          <description>Slope of sixth piecewise linear function</description>
          <addressOffset>0x534</addressOffset>
          <access>read-write</access>
          <resetValue>0x000004B7</resetValue>
          <fields>
            <field>
              <name>A5</name>
              <description>Slope of sixth piecewise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B0</name>
          <description>y-intercept of first piecewise linear function</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000FC7</resetValue>
          <fields>
            <field>
              <name>B0</name>
              <description>y-intercept of first piecewise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B1</name>
          <description>y-intercept of second piecewise linear function</description>
          <addressOffset>0x544</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000F71</resetValue>
          <fields>
            <field>
              <name>B1</name>
              <description>y-intercept of second piecewise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B2</name>
          <description>y-intercept of third piecewise linear function</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000F6C</resetValue>
          <fields>
            <field>
              <name>B2</name>
              <description>y-intercept of third piecewise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B3</name>
          <description>y-intercept of fourth piecewise linear function</description>
          <addressOffset>0x54C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000FCB</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>y-intercept of fourth piecewise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B4</name>
          <description>y-intercept of fifth piecewise linear function</description>
          <addressOffset>0x550</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000004B</resetValue>
          <fields>
            <field>
              <name>B4</name>
              <description>y-intercept of fifth piecewise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B5</name>
          <description>y-intercept of sixth piecewise linear function</description>
          <addressOffset>0x554</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000F6</resetValue>
          <fields>
            <field>
              <name>B5</name>
              <description>y-intercept of sixth piecewise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>T0</name>
          <description>Endpoint of first piecewise linear function</description>
          <addressOffset>0x560</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000E1</resetValue>
          <fields>
            <field>
              <name>T0</name>
              <description>Endpoint of first piecewise linear function</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>T1</name>
          <description>Endpoint of second piecewise linear function</description>
          <addressOffset>0x564</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000F9</resetValue>
          <fields>
            <field>
              <name>T1</name>
              <description>Endpoint of second piecewise linear function</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>T2</name>
          <description>Endpoint of third piecewise linear function</description>
          <addressOffset>0x568</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>T2</name>
              <description>Endpoint of third piecewise linear function</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>T3</name>
          <description>Endpoint of fourth piecewise linear function</description>
          <addressOffset>0x56C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000026</resetValue>
          <fields>
            <field>
              <name>T3</name>
              <description>Endpoint of fourth piecewise linear function</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>T4</name>
          <description>Endpoint of fifth piecewise linear function</description>
          <addressOffset>0x570</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <fields>
            <field>
              <name>T4</name>
              <description>Endpoint of fifth piecewise linear function</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
