nrf-rs/nrf-pacs/svds/nrf5340-net.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="RTC0_NS">
      <name>RTC1_NS</name>
      <description>Real-time counter 1</description>
      <baseAddress>0x41016000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <interrupt>
        <name>RTC1</name>
        <value>22</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER0_NS">
      <name>TIMER1_NS</name>
      <description>Timer/Counter 1</description>
      <baseAddress>0x41018000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <interrupt>
        <name>TIMER1</name>
        <value>24</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER0_NS">
      <name>TIMER2_NS</name>
      <description>Timer/Counter 2</description>
      <baseAddress>0x41019000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <interrupt>
        <name>TIMER2</name>
        <value>25</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SWI0_NS</name>
      <description>Software interrupt 0</description>
      <baseAddress>0x4101A000</baseAddress>
      <headerStructName>SWI</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SWI0</name>
        <value>26</value>
      </interrupt>
      <groupName>SWI</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>UNUSED</name>
          <description>Unused.</description>
          <addressOffset>0x000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <access>read-only</access>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="SWI0_NS">
      <name>SWI1_NS</name>
      <description>Software interrupt 1</description>
      <baseAddress>0x4101B000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <interrupt>
        <name>SWI1</name>
        <value>27</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0_NS">
      <name>SWI2_NS</name>
      <description>Software interrupt 2</description>
      <baseAddress>0x4101C000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <interrupt>
        <name>SWI2</name>
        <value>28</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0_NS">
      <name>SWI3_NS</name>
      <description>Software interrupt 3</description>
      <baseAddress>0x4101D000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <interrupt>
        <name>SWI3</name>
        <value>29</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>APPMUTEX_NS</name>
      <description>MUTEX 0</description>
      <baseAddress>0x40030000</baseAddress>
      <headerStructName>MUTEX</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>MUTEX</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x10</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MUTEX[%s]</name>
          <description>Description collection: Mutex register</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUTEX</name>
              <description>Mutex register n</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>Mutex n is in unlocked state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Mutex n is in locked state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="APPMUTEX_NS">
      <name>APPMUTEX_S</name>
      <description>MUTEX 1</description>
      <baseAddress>0x50030000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral>
      <name>ACL_NS</name>
      <description>Access control lists</description>
      <baseAddress>0x41080000</baseAddress>
      <headerStructName>ACL</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>ACL</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>ACL[%s]</name>
          <description>Unspecified</description>
          <headerStructName>ACL_ACL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>ADDR</name>
            <description>Description cluster: Start address of region to protect. The start address must be word-aligned.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeOnce</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Start address of flash region n. The start address must point to a flash page boundary.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SIZE</name>
            <description>Description cluster: Size of region to protect counting from address ACL[n].ADDR. Writing a '0' has no effect.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-writeOnce</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SIZE</name>
                <description>Size of flash region n in bytes. Must be a multiple of the flash page size.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PERM</name>
            <description>Description cluster: Access permissions for region n as defined by start address ACL[n].ADDR and size ACL[n].SIZE</description>
            <addressOffset>0x008</addressOffset>
            <access>read-writeOnce</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>WRITE</name>
                <description>Configure write and erase permissions for region n. Writing a '0' has no effect.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow write and erase instructions to region n.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block write and erase instructions to region n.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>READ</name>
                <description>Configure read permissions for region n. Writing a '0' has no effect.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow read instructions to region n.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block read instructions to region n.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
